app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "movies" SET "title" = ?, "updated_at" = ? WHERE "movies"."id" = 1  [["title", "Iron Man1"], ["updated_at", Sat, 22 Mar 2014 10:22:58 UTC +00:00]]
---
  def update
    @movie = Movie.find(params[:id])
    if @movie.update(movie_params)

SELECT "movies".* FROM "movies" WHERE (released_on <= '2014-03-20 12:52:23.828115') ORDER BY released_on desc
---
  def set_movie
    @movie = Movie.find(params[:movie_id])